app/controllers/articles_controller.rb

  def update
    #raise params.inspect
    #The raise method will cause the application to pause and print out the params on
    #an error page. You could also see the params if you called puts params.inspect;
    #using puts would simply require you to track down the data in the Rails server log.
    @article = Article.find(params[:id])
  @article.update(title: params[:article][:title], description: params[:article][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-12-20 04:03:24.100279"], ["id", 1]]